package Day06Demo.com.itheima._02类与对象;
/*
* 类与对象：
*    面向对象中最重要的两个概念：类 与 对象。
*    面向对象是用代码来模拟现实世界的事物的。
*
*    类：是把相同事物的共同特征（属性）抽离到一起的一个抽象描述。
*       类只是一个学术用语，并非真实存在的事物。
*       例如：人类，是人的共同特征描述到了一起的一个概念。
*
*
*    对象：对象是类的具体的一个实例 （对象 == 实例）
*         对象是真实存在的，对象是由类衍生出来的。
*       例如：桌子是一个类，这个桌子是对象。
*            张三是一个对象。
*            我是一个对象，你们是学生类，李东江是一个学生类的对象（实例）
*
*   万千事物都是对象，它们都归属与类
*   所以只要有类和对象就可以把这个世界上所有的事物联系起来。
*
*   所以Java的核心就是建立类，创建类的对象代表具体的事物
*   再把对象联系起来，或者调用这些对象的行为（方法）就可以完成一切业务。
*
*/
public class ClassAndObject01 {

}
