package com.itheima._01反馈问题;

/**
 ***	希望能在讲课的过程中穿插拓展知识点

 ***	全A好评，从我做起， 我叫陶震。
 ***	老师,讲讲您学英语的经历,感觉脑子不够用啊,太多单词要记住了,唉.学得我头皮发麻,双脚抽筋
        ,一向对English十分抗拒的我,该如何做到记单词啊.--陶震

 ***	我是Dlei最喜欢的蜘蛛精,求好心人给我648块让我回家,我不知道大表哥2也不玩氪金手游
 ***	老师，我想套我旁边的那位麻袋，打击人

 ***	老师，我有一个困扰，从基础班入学以来，每次上课都是一听就懂，代码一写就对，
        好害怕自己一出去就月薪过万，怎么办，很慌，我努力过，我尝试过，我曾经有连续七天不听课，
        可是没有用，这代码还是一写就对，又不敢和其他同学说，
        因为我也不知道其他同学是不是也有同样的困扰，我不想把个人的烦恼带给大家，
        但是我现在真的很困惑，只能在考试的时候故意把答案选错，以此来掩盖自己的才华

 ***	特困生不敢说话

 ***	1.讲一个新知识点的时候，尽量不要一上来就告诉我们怎么做,而是先告诉我们是用来干嘛的.
        2.建议把知识点之间的关系梳理清楚，形成完整清晰的知识体系.
        3.老师你inner的读音不对，听着很难受

 ***	各位同学，老师，大家好，提前祝大家新年好，祝大家心想事成，万事如意！
 -- 	1.不可重复读一定要避免吗？有没有需要用到“不可重复读”的场合？
        2.关于“不可重复读的案例”，既然事务1已经commit了，事务2读到即时更新的数据不是更好吗？
        还再读之前的1000，1000的话，不是反而造成错误吗？
        A:张三 ==>
        B:李四

        A: 1000  500  = 200 commit
        B: 1000  - 500 = 500 commit;
         不一致本身没有错误。错的是不知道会不一致。
 */
public class Demo01 {
}
