package Day10Demo.com.itheima._01API的使用步骤;
/*
 * API:
 *  概述
    API(Application Programming Interface)，应用程序编程接口。Java API是一本程序员的 字典 ，Java API是JDK中
    提供给我们使用的类。这些类将底层的代码实现封装了起来，我们不需要关心这些类是如何实现的，只需要学习这
    些类如何使用即可。所以我们可以通过查询API的方式，来学习Java提供的类，并得知如何使用它们

    Java API :
             Java的使用说明书。
             API就是别人已经写好的类和方法，用于完成特定的功能的
             使用说明。
             程序员只需要按照说明书去使用这些类调用方法完成自己
             想要实现的功能即可，底层具体的细节无需理会。

             拿别人写好的技术为我所用。

   API使用步骤：

        下载API文档，对所有技术通用的步骤。

        1. 打开帮助文档。
        2. 点击显示，找到索引，看到输入框。
        3. 你要找谁？在输入框里输入，然后回车。
        4. 看包。java.lang下的类不需要导包，其他需要。
        5. 看类的解释和说明。
        6. 学习构造器：创建对象
        7. 看调用的方法，完成具体的功能
           看方法的分类：
           如果方法是实例方法，说明要先创建对象再调用。
           如果方法是静态方法，无需创建对象，直接用类名调用即可。

      工作解决问题：
         （1）查相关技术的API文档。
         （2）百度 google去搜索解决方案，根据提示再次去查看API。
         （3）问你的同事。
 *
 *
 *
 */
public class APIDemo01 {
    public static void main(String[] args){

    }
}
