package com.itheima._01反馈问题;

/**
 ***	今日内容：无言独上西楼，月如钩，寂寞梧桐深院锁清秋，仰天长啸，我也许真的是个**吧。
 ***	1.老师，我课堂前预习一遍全部内容基本全部懂了，
        上课你再讲一次我就完全理解了，
        作业基本不看答案能做出来，我觉得编程好简单啊，
        继续保持下去把接下来的内容全部掌握的话能达到几等程序员的水平啊？能月薪15k吗？
        2.关于sql注入，java中有办法也在键盘录入里录入可执行java语句吗？
        int age = 10;
        有的话该怎么解决
        3.预习资料要没有了，再发多点出来.

 ***	零基础过来这里学了那么久天真的以为不算很难，直到今天成功的懵逼了

 ***	我要用眼神消灭你们_____老庞
 ***	什么时候能把这些东西用起来？

 ***	我能跟上老师的speed
 ***	懵逼树上懵逼果,懵逼树下你和我.
 ***	感觉思维有点混乱了
 ***	今天的课让我想起一句话，我大概是个**吧，内容太多，又难，敲代码的时间完全不够啊，
        还连续上这么多天课，明天实操课也好啊
 ***	听明白了，可是记不住！天天上新，天天都是一知半解的这样真的好嘛？跟不上的节奏！
 ***	只能安静草代码了。
 ***	老师每一节课程有没有一个类似思维导图这样讲内容整合，
        如果学前，简讲解一下，听课思路就清晰很多
 */
public class Demo01 {

}
