package com.itheima._01反馈问题;

/**
 ***	老师讲java相对就没那么困,我精神就很好,但是讲MySQL,
        就只需要五分钟我就能直接睡着... 我也不知道该怎么描述这个问题的原因
        或许您自己思考一下?

 ***	钢琴老师，您上课提的try(){} 关闭资源的不适用之处还没讲。。。。try(){}实在太好用了。。。

 ***	课堂测试能布置多几题吗？

 ***	1，我们以后毕业，一般工作的内容是做什么？应聘的是什么岗位呢？
        2，能说下MYSQL是是怎样性能调优的吗？

        后台管理系统
        电商项目
        网站开发
        服务器端开发

 ***	好烦好烦好烦好烦好烦好烦好烦好烦好烦好烦好烦好烦好烦好烦……

 ***	希望 所有笔记都能够在IDEA上面写 ，在其他文档看笔记感觉没那么方便

 ***	好简单，好烦，这代码又是一写就对，月薪过万就月薪过万吧，我已经放弃挣扎了，
        就让我堕落下去吧

 ***	听老师讲课比看鲁迅先生早期的文章效果更好！！

 ***	今天学的方法还是很多，记住的没几个。看来还是要写到吐才有资格用快捷键，
        至少要像老师的十年功底才可以是吧？不然单词都记不住！老师十年功底都有时候拼错，\
        更何况尔等呢？！必须手打！

 -- 	老师你的IDEA的字体能不能大一点 有点小 容易困 背景颜色能不能绿一点
        听说 程序员比较喜欢绿色的! 白色的有点伤 难受
 */
public class Demo01 {

}
