package Day06Demo.com.itheima._01面向对象的思想;
/*
* 面向对象的思想：
*    软件是用来模拟现实事物的，面向对象的意思其实就是使用代码
*    把现实世界中的事物模拟出来，然后像现实世界处理事物一样
*    用代码去完成yong事物的处理。
*
*    软件就可以帮助人类解决问题。
*
*    人 ：就可以用代码设计一个人。
*    班级：用代码设计一个班级。
*
*    面向对象是非常接近现实世界的思想，面向对象是几乎所有高级语言都支持的设计。
*    是现今最先进的软件设计思想。面向对象的语言是高级语言。
*
*  洗衣服:
    面向过程：把衣服脱下来-->找一个盆-->放点洗衣粉-->加点水-->浸泡10分钟-->揉一揉-->清洗衣服-->拧干-->晾
    起来

    面向对象：把衣服脱下来(对象)--> 打开全自动洗衣机(对象)-->按钮(方法)
*
* 面向对象：
*    面向过程：强调步骤。
*    面向对象：强调对象，这里的对象就是洗衣机。
*
*/
public class ObjectDemo01 {
}
